Jackhenry/xmlTemplates/SampleTemplates/custreladd_owner.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <SOAP-ENV:Header>
    <wsse:Security
      xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
      xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
      <wsse:UsernameToken
        xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
        <wsse:Username>{{X-UserName}}</wsse:Username>
        <wsse:Password
          Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">{{X-Password}}</wsse:Password>
        <wsu:Created
          xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">{{current_timestamp}}</wsu:Created>
      </wsse:UsernameToken>
    </wsse:Security>
  </SOAP-ENV:Header>
  <SOAP-ENV:Body>
    <CustRelAdd
      xmlns="http://jackhenry.com/jxchange/TPG/2008">
      <MsgRqHdr>
        <jXchangeHdr>
          <JxVer />
          <AuditUsrId>{{X-AuditUser}}</AuditUsrId>
          <AuditWsId>{{X-AuditWorkStation}}</AuditWsId>
          <AuthenUsrId />
          <ConsumerName />
          <ConsumerProd />
          <Ver_1 />
          <jXLogTrackingId>{{$guid}}</jXLogTrackingId>
          <Ver_2 />
          <InstRtId>{{X-InstitutionRoutingID}}</InstRtId>
          <InstEnv>{{X-Environment}}</InstEnv>
          <Ver_3 />
          <BusCorrelId>{{$guid}}</BusCorrelId>
          <Ver_4 />
          <WorkflowCorrelId />
          <Ver_5 />
          <ValidConsmName>{{X-ValidConsumerName}}</ValidConsmName>
          <ValidConsmProd>{{X-ValidConsumerProduct}}</ValidConsmProd>
          <Ver_6 />
        </jXchangeHdr>
        <Ver_1 />
        <Ver_2 />
        <Ver_3 />
      </MsgRqHdr>
      <CustId>XAA0047</CustId>
      <CustRelRec>
        <Ver_1 />
        <Ver_2 />
        <Ver_3 />
        <IdVerifyBy>Charles Barkley</IdVerifyBy>
        <IdVerifyRsnCode>1</IdVerifyRsnCode>
        <VerifyDt>2024-02-28</VerifyDt>
        <Ver_4 />
      </CustRelRec>
      <Ver_1 />
      <BenflOwnInfo>
        <CustId>DAA4291</CustId>
        <PersonName>
          <ComName>John B Doe</ComName>
          <Ver_1 />
        </PersonName>
        <BenflOwnType>CntlOwn</BenflOwnType>
        <CntlIndivTitle>Director</CntlIndivTitle>
        <BenflOwnPct>25</BenflOwnPct>
        <Ver_1 />
      </BenflOwnInfo>
      <Ver_2 />
      <Ver_3 />
    </CustRelAdd>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>